In [1]:
from pandas import DataFrame
df = DataFrame(
                [
                [19,14,18,19],
                [18,10,17,16],
                [17,16,18,15]   
                ]
                  ,columns=['OSA','JAVA','SE','DS'])
df

   OSA  JAVA  SE  DS
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [2]:
df.sum()

OSA     54
JAVA    40
SE      53
DS      50
dtype: int64

In [3]:
df.max()

OSA     19
JAVA    16
SE      18
DS      19
dtype: int64

In [4]:
df.min()

OSA     17
JAVA    10
SE      17
DS      15
dtype: int64

In [5]:
df.mean()

OSA     18.000000
JAVA    13.333333
SE      17.666667
DS      16.666667
dtype: float64

In [6]:
df.count()

OSA     3
JAVA    3
SE      3
DS      3
dtype: int64

In [7]:
df.describe()

        OSA       JAVA         SE         DS
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

In [8]:
df.agg(["sum","min","max","std","count"])

        OSA      JAVA        SE         DS
sum    54.0  40.00000  53.00000  50.000000
min    17.0  10.00000  17.00000  15.000000
max    19.0  16.00000  18.00000  19.000000
std     1.0   3.05505   0.57735   2.081666
count   3.0   3.00000   3.00000   3.000000

# GROUPING FUNTION

In [14]:
import pandas as pd
from pandas import DataFrame
df1 = DataFrame([
                ['Aryan','singh','Full-time','adminstration',2,20000],
                ['Rohan','Agarwal','intern','Technical',3,5000],
                ['Riya','shah','Full-time','adminstration',5,10000 ],
                ['Yash','Bhatia','part-time','Technical',7,10000 ],
                ['Siddant','Khanna','Full-time','Management',6,20000]
                             ]
                               ,columns=['First Name','Last Name','Type','Department','YoE','Salary']   
                            )
df1

  First Name Last Name       Type     Department  YoE  Salary
0      Aryan     singh  Full-time  adminstration    2   20000
1      Rohan   Agarwal     intern      Technical    3    5000
2       Riya      shah  Full-time  adminstration    5   10000
3       Yash    Bhatia  part-time      Technical    7   10000
4    Siddant    Khanna  Full-time     Management    6   20000

In [15]:
df1.groupby(['Type']).sum()

           YoE  Salary
Type
Full-time   13   50000
intern       3    5000
part-time    7   10000

In [19]:
df1.groupby(['Type']).mean()

                YoE        Salary
Type
Full-time  4.333333  16666.666667
intern     3.000000   5000.000000
part-time  7.000000  10000.000000

In [23]:
df1.groupby(['Department','Type']).sum()

                         YoE  Salary
Department    Type
Management    Full-time    6   20000
Technical     intern       3    5000
              part-time    7   10000
adminstration Full-time    7   30000

In [27]:
df1.groupby(['Type','Department']).sum()

                         YoE  Salary
Type      Department
Full-time Management       6   20000
          adminstration    7   30000
intern    Technical        3    5000
part-time Technical        7   10000